MikroElektronika/core_packages/PIC/XC8/def/PIC16LF1716/mcu.h
// NCO1ACCL<NCO1ACC3>
extern volatile __bit                   NCO1ACC3            __at(0x24C3);	// @ (0x498 * 8 + 3)
#define                                 NCO1ACC3_bit        _BIT_ACCESS(NCO1ACCL,3)
// NCO1ACCL<NCO1ACC4>
extern volatile __bit                   NCO1ACC4            __at(0x24C4);	// @ (0x498 * 8 + 4)
#define                                 NCO1ACC4_bit        _BIT_ACCESS(NCO1ACCL,4)
// NCO1ACCL<NCO1ACC5>
extern volatile __bit                   NCO1ACC5            __at(0x24C5);	// @ (0x498 * 8 + 5)
#define                                 NCO1ACC5_bit        _BIT_ACCESS(NCO1ACCL,5)
// NCO1ACCL<NCO1ACC6>
extern volatile __bit                   NCO1ACC6            __at(0x24C6);	// @ (0x498 * 8 + 6)
#define                                 NCO1ACC6_bit        _BIT_ACCESS(NCO1ACCL,6)
// NCO1ACCL<NCO1ACC7>
extern volatile __bit                   NCO1ACC7            __at(0x24C7);	// @ (0x498 * 8 + 7)
#define                                 NCO1ACC7_bit        _BIT_ACCESS(NCO1ACCL,7)
// NCO1ACCH<NCO1ACC8>
extern volatile __bit                   NCO1ACC8            __at(0x24C8);	// @ (0x499 * 8 + 0)
#define                                 NCO1ACC8_bit        _BIT_ACCESS(NCO1ACCH,0)
// NCO1ACCH<NCO1ACC9>
extern volatile __bit                   NCO1ACC9            __at(0x24C9);	// @ (0x499 * 8 + 1)
#define                                 NCO1ACC9_bit        _BIT_ACCESS(NCO1ACCH,1)
// NCO1INCL<NCO1INC0>
extern volatile __bit                   NCO1INC0            __at(0x24D8);	// @ (0x49B * 8 + 0)
#define                                 NCO1INC0_bit        _BIT_ACCESS(NCO1INCL,0)
// NCO1INCL<NCO1INC1>
extern volatile __bit                   NCO1INC1            __at(0x24D9);	// @ (0x49B * 8 + 1)
#define                                 NCO1INC1_bit        _BIT_ACCESS(NCO1INCL,1)
// NCO1INCH<NCO1INC10>
extern volatile __bit                   NCO1INC10           __at(0x24E2);	// @ (0x49C * 8 + 2)
#define                                 NCO1INC10_bit       _BIT_ACCESS(NCO1INCH,2)
// NCO1INCH<NCO1INC11>
extern volatile __bit                   NCO1INC11           __at(0x24E3);	// @ (0x49C * 8 + 3)
#define                                 NCO1INC11_bit       _BIT_ACCESS(NCO1INCH,3)
// NCO1INCH<NCO1INC12>
extern volatile __bit                   NCO1INC12           __at(0x24E4);	// @ (0x49C * 8 + 4)
#define                                 NCO1INC12_bit       _BIT_ACCESS(NCO1INCH,4)
// NCO1INCH<NCO1INC13>
extern volatile __bit                   NCO1INC13           __at(0x24E5);	// @ (0x49C * 8 + 5)
#define                                 NCO1INC13_bit       _BIT_ACCESS(NCO1INCH,5)
// NCO1INCH<NCO1INC14>
extern volatile __bit                   NCO1INC14           __at(0x24E6);	// @ (0x49C * 8 + 6)
#define                                 NCO1INC14_bit       _BIT_ACCESS(NCO1INCH,6)
// NCO1INCH<NCO1INC15>
extern volatile __bit                   NCO1INC15           __at(0x24E7);	// @ (0x49C * 8 + 7)
#define                                 NCO1INC15_bit       _BIT_ACCESS(NCO1INCH,7)
// NCO1INCU<NCO1INC16>
extern volatile __bit                   NCO1INC16           __at(0x24E8);	// @ (0x49D * 8 + 0)
#define                                 NCO1INC16_bit       _BIT_ACCESS(NCO1INCU,0)
// NCO1INCU<NCO1INC17>
extern volatile __bit                   NCO1INC17           __at(0x24E9);	// @ (0x49D * 8 + 1)
#define                                 NCO1INC17_bit       _BIT_ACCESS(NCO1INCU,1)
// NCO1INCU<NCO1INC18>
extern volatile __bit                   NCO1INC18           __at(0x24EA);	// @ (0x49D * 8 + 2)
#define                                 NCO1INC18_bit       _BIT_ACCESS(NCO1INCU,2)
// NCO1INCU<NCO1INC19>
extern volatile __bit                   NCO1INC19           __at(0x24EB);	// @ (0x49D * 8 + 3)
#define                                 NCO1INC19_bit       _BIT_ACCESS(NCO1INCU,3)
// NCO1INCL<NCO1INC2>
extern volatile __bit                   NCO1INC2            __at(0x24DA);	// @ (0x49B * 8 + 2)
#define                                 NCO1INC2_bit        _BIT_ACCESS(NCO1INCL,2)
// NCO1INCL<NCO1INC3>
extern volatile __bit                   NCO1INC3            __at(0x24DB);	// @ (0x49B * 8 + 3)
#define                                 NCO1INC3_bit        _BIT_ACCESS(NCO1INCL,3)
// NCO1INCL<NCO1INC4>
extern volatile __bit                   NCO1INC4            __at(0x24DC);	// @ (0x49B * 8 + 4)
#define                                 NCO1INC4_bit        _BIT_ACCESS(NCO1INCL,4)
// NCO1INCL<NCO1INC5>
extern volatile __bit                   NCO1INC5            __at(0x24DD);	// @ (0x49B * 8 + 5)
#define                                 NCO1INC5_bit        _BIT_ACCESS(NCO1INCL,5)
// NCO1INCL<NCO1INC6>
extern volatile __bit                   NCO1INC6            __at(0x24DE);	// @ (0x49B * 8 + 6)
#define                                 NCO1INC6_bit        _BIT_ACCESS(NCO1INCL,6)
// NCO1INCL<NCO1INC7>
extern volatile __bit                   NCO1INC7            __at(0x24DF);	// @ (0x49B * 8 + 7)
#define                                 NCO1INC7_bit        _BIT_ACCESS(NCO1INCL,7)
// NCO1INCH<NCO1INC8>
extern volatile __bit                   NCO1INC8            __at(0x24E0);	// @ (0x49C * 8 + 0)
#define                                 NCO1INC8_bit        _BIT_ACCESS(NCO1INCH,0)
// NCO1INCH<NCO1INC9>
extern volatile __bit                   NCO1INC9            __at(0x24E1);	// @ (0x49C * 8 + 1)
#define                                 NCO1INC9_bit        _BIT_ACCESS(NCO1INCH,1)
// PIE3<NCOIE>
extern volatile __bit                   NCOIE               __at(0x49E);	// @ (0x93 * 8 + 6)
#define                                 NCOIE_bit           _BIT_ACCESS(PIE3,6)
// PIR3<NCOIF>
extern volatile __bit                   NCOIF               __at(0x9E);	// @ (0x13 * 8 + 6)
#define                                 NCOIF_bit           _BIT_ACCESS(PIR3,6)
// DAC2CON0<NSS>
extern volatile __bit                   NSS                 __at(0x8D0);	// @ (0x11A * 8 + 0)
#define                                 NSS_bit             _BIT_ACCESS(DAC2CON0,0)
// ODCONA<ODA0>
extern volatile __bit                   ODA0                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODA0_bit            _BIT_ACCESS(ODCONA,0)
// ODCONA<ODA1>
extern volatile __bit                   ODA1                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODA1_bit            _BIT_ACCESS(ODCONA,1)
// ODCONA<ODA2>
extern volatile __bit                   ODA2                __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODA2_bit            _BIT_ACCESS(ODCONA,2)
// ODCONA<ODA3>
extern volatile __bit                   ODA3                __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 ODA3_bit            _BIT_ACCESS(ODCONA,3)
// ODCONA<ODA4>
extern volatile __bit                   ODA4                __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODA4_bit            _BIT_ACCESS(ODCONA,4)
// ODCONA<ODA5>
extern volatile __bit                   ODA5                __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODA5_bit            _BIT_ACCESS(ODCONA,5)
// ODCONA<ODA6>
extern volatile __bit                   ODA6                __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 ODA6_bit            _BIT_ACCESS(ODCONA,6)
// ODCONA<ODA7>
extern volatile __bit                   ODA7                __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 ODA7_bit            _BIT_ACCESS(ODCONA,7)
// ODCONB<ODB0>
extern volatile __bit                   ODB0                __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 ODB0_bit            _BIT_ACCESS(ODCONB,0)
// ODCONB<ODB1>
extern volatile __bit                   ODB1                __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 ODB1_bit            _BIT_ACCESS(ODCONB,1)
// ODCONB<ODB2>
extern volatile __bit                   ODB2                __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 ODB2_bit            _BIT_ACCESS(ODCONB,2)
// ODCONB<ODB3>
extern volatile __bit                   ODB3                __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 ODB3_bit            _BIT_ACCESS(ODCONB,3)
// ODCONB<ODB4>
extern volatile __bit                   ODB4                __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODB4_bit            _BIT_ACCESS(ODCONB,4)
// ODCONB<ODB5>
extern volatile __bit                   ODB5                __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODB5_bit            _BIT_ACCESS(ODCONB,5)
// ODCONB<ODB6>
extern volatile __bit                   ODB6                __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODB6_bit            _BIT_ACCESS(ODCONB,6)
// ODCONB<ODB7>
extern volatile __bit                   ODB7                __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODB7_bit            _BIT_ACCESS(ODCONB,7)
// ODCONC<ODC0>
extern volatile __bit                   ODC0                __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODC0_bit            _BIT_ACCESS(ODCONC,0)
// ODCONC<ODC1>
extern volatile __bit                   ODC1                __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODC1_bit            _BIT_ACCESS(ODCONC,1)
// ODCONC<ODC2>
extern volatile __bit                   ODC2                __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODC2_bit            _BIT_ACCESS(ODCONC,2)
// ODCONC<ODC3>
extern volatile __bit                   ODC3                __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODC3_bit            _BIT_ACCESS(ODCONC,3)
// ODCONC<ODC4>
extern volatile __bit                   ODC4                __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODC4_bit            _BIT_ACCESS(ODCONC,4)
// ODCONC<ODC5>
extern volatile __bit                   ODC5                __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODC5_bit            _BIT_ACCESS(ODCONC,5)
// ODCONC<ODC6>
extern volatile __bit                   ODC6                __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODC6_bit            _BIT_ACCESS(ODCONC,6)
// ODCONC<ODC7>
extern volatile __bit                   ODC7                __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODC7_bit            _BIT_ACCESS(ODCONC,7)
// DAC2CON0<OE1>
extern volatile __bit                   OE1                 __at(0x8D5);	// @ (0x11A * 8 + 5)
#define                                 OE1_bit             _BIT_ACCESS(DAC2CON0,5)
// DAC2CON0<OE2>
extern volatile __bit                   OE2                 __at(0x8D4);	// @ (0x11A * 8 + 4)
#define                                 OE2_bit             _BIT_ACCESS(DAC2CON0,4)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// OPA1CON<OPA1CH0>
extern volatile __bit                   OPA1CH0             __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1CH0_bit         _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1CH1>
extern volatile __bit                   OPA1CH1             __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1CH1_bit         _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x288F);	// @ (0x511 * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON,7)
// OPA1CON<OPA1PCH0>
extern volatile __bit                   OPA1PCH0            __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1PCH0_bit        _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1PCH1>
extern volatile __bit                   OPA1PCH1            __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1PCH1_bit        _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1SP>
extern volatile __bit                   OPA1SP              __at(0x288E);	// @ (0x511 * 8 + 6)
#define                                 OPA1SP_bit          _BIT_ACCESS(OPA1CON,6)
// OPA1CON<OPA1UG>
extern volatile __bit                   OPA1UG              __at(0x288C);	// @ (0x511 * 8 + 4)
#define                                 OPA1UG_bit          _BIT_ACCESS(OPA1CON,4)
// OPA2CON<OPA2CH0>
extern volatile __bit                   OPA2CH0             __at(0x28A8);	// @ (0x515 * 8 + 0)
#define                                 OPA2CH0_bit         _BIT_ACCESS(OPA2CON,0)
// OPA2CON<OPA2CH1>
extern volatile __bit                   OPA2CH1             __at(0x28A9);	// @ (0x515 * 8 + 1)
#define                                 OPA2CH1_bit         _BIT_ACCESS(OPA2CON,1)
// OPA2CON<OPA2EN>
extern volatile __bit                   OPA2EN              __at(0x28AF);	// @ (0x515 * 8 + 7)
#define                                 OPA2EN_bit          _BIT_ACCESS(OPA2CON,7)
// OPA2CON<OPA2PCH0>
extern volatile __bit                   OPA2PCH0            __at(0x28A8);	// @ (0x515 * 8 + 0)
#define                                 OPA2PCH0_bit        _BIT_ACCESS(OPA2CON,0)
// OPA2CON<OPA2PCH1>
extern volatile __bit                   OPA2PCH1            __at(0x28A9);	// @ (0x515 * 8 + 1)
#define                                 OPA2PCH1_bit        _BIT_ACCESS(OPA2CON,1)
// OPA2CON<OPA2SP>
extern volatile __bit                   OPA2SP              __at(0x28AE);	// @ (0x515 * 8 + 6)
#define                                 OPA2SP_bit          _BIT_ACCESS(OPA2CON,6)
// OPA2CON<OPA2UG>
extern volatile __bit                   OPA2UG              __at(0x28AC);	// @ (0x515 * 8 + 4)
#define                                 OPA2UG_bit          _BIT_ACCESS(OPA2CON,4)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4D5);	// @ (0x9A * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// CCPTMRS<P3TSEL0>
extern volatile __bit                   P3TSEL0             __at(0x14F4);	// @ (0x29E * 8 + 4)
#define                                 P3TSEL0_bit         _BIT_ACCESS(CCPTMRS,4)
// CCPTMRS<P3TSEL1>
extern volatile __bit                   P3TSEL1             __at(0x14F5);	// @ (0x29E * 8 + 5)
#define                                 P3TSEL1_bit         _BIT_ACCESS(CCPTMRS,5)
// CCPTMRS<P4TSEL0>
extern volatile __bit                   P4TSEL0             __at(0x14F6);	// @ (0x29E * 8 + 6)
#define                                 P4TSEL0_bit         _BIT_ACCESS(CCPTMRS,6)
// CCPTMRS<P4TSEL1>
extern volatile __bit                   P4TSEL1             __at(0x14F7);	// @ (0x29E * 8 + 7)
#define                                 P4TSEL1_bit         _BIT_ACCESS(CCPTMRS,7)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4D6);	// @ (0x9A * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// OPTION_REG<PS0>
extern volatile __bit                   PS0                 __at(0x4A8);	// @ (0x95 * 8 + 0)
#define                                 PS0_bit             _BIT_ACCESS(OPTION_REG,0)
// OPTION_REG<PS1>
extern volatile __bit                   PS1                 __at(0x4A9);	// @ (0x95 * 8 + 1)
#define                                 PS1_bit             _BIT_ACCESS(OPTION_REG,1)
// OPTION_REG<PS2>
extern volatile __bit                   PS2                 __at(0x4AA);	// @ (0x95 * 8 + 2)
#define                                 PS2_bit             _BIT_ACCESS(OPTION_REG,2)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4AB);	// @ (0x95 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// DAC2CON0<PSS0>
extern volatile __bit                   PSS0                __at(0x8D2);	// @ (0x11A * 8 + 2)
#define                                 PSS0_bit            _BIT_ACCESS(DAC2CON0,2)
// DAC2CON0<PSS1>
extern volatile __bit                   PSS1                __at(0x8D3);	// @ (0x11A * 8 + 3)
#define                                 PSS1_bit            _BIT_ACCESS(DAC2CON0,3)
// PWM3DCH<PWM3DCH0>
extern volatile __bit                   PWM3DCH0            __at(0x30C0);	// @ (0x618 * 8 + 0)
#define                                 PWM3DCH0_bit        _BIT_ACCESS(PWM3DCH,0)
// PWM3DCH<PWM3DCH1>
extern volatile __bit                   PWM3DCH1            __at(0x30C1);	// @ (0x618 * 8 + 1)
#define                                 PWM3DCH1_bit        _BIT_ACCESS(PWM3DCH,1)
// PWM3DCH<PWM3DCH2>
extern volatile __bit                   PWM3DCH2            __at(0x30C2);	// @ (0x618 * 8 + 2)
#define                                 PWM3DCH2_bit        _BIT_ACCESS(PWM3DCH,2)
// PWM3DCH<PWM3DCH3>
extern volatile __bit                   PWM3DCH3            __at(0x30C3);	// @ (0x618 * 8 + 3)
#define                                 PWM3DCH3_bit        _BIT_ACCESS(PWM3DCH,3)
// PWM3DCH<PWM3DCH4>
extern volatile __bit                   PWM3DCH4            __at(0x30C4);	// @ (0x618 * 8 + 4)
#define                                 PWM3DCH4_bit        _BIT_ACCESS(PWM3DCH,4)
// PWM3DCH<PWM3DCH5>
extern volatile __bit                   PWM3DCH5            __at(0x30C5);	// @ (0x618 * 8 + 5)
#define                                 PWM3DCH5_bit        _BIT_ACCESS(PWM3DCH,5)
// PWM3DCH<PWM3DCH6>
extern volatile __bit                   PWM3DCH6            __at(0x30C6);	// @ (0x618 * 8 + 6)
#define                                 PWM3DCH6_bit        _BIT_ACCESS(PWM3DCH,6)
// PWM3DCH<PWM3DCH7>
extern volatile __bit                   PWM3DCH7            __at(0x30C7);	// @ (0x618 * 8 + 7)
#define                                 PWM3DCH7_bit        _BIT_ACCESS(PWM3DCH,7)
// PWM3DCL<PWM3DCL0>
extern volatile __bit                   PWM3DCL0            __at(0x30BE);	// @ (0x617 * 8 + 6)
#define                                 PWM3DCL0_bit        _BIT_ACCESS(PWM3DCL,6)
// PWM3DCL<PWM3DCL1>
extern volatile __bit                   PWM3DCL1            __at(0x30BF);	// @ (0x617 * 8 + 7)
#define                                 PWM3DCL1_bit        _BIT_ACCESS(PWM3DCL,7)
// PWM3CON<PWM3EN>
extern volatile __bit                   PWM3EN              __at(0x30CF);	// @ (0x619 * 8 + 7)
#define                                 PWM3EN_bit          _BIT_ACCESS(PWM3CON,7)
// PWM3CON<PWM3OUT>
extern volatile __bit                   PWM3OUT             __at(0x30CD);	// @ (0x619 * 8 + 5)
#define                                 PWM3OUT_bit         _BIT_ACCESS(PWM3CON,5)
// PWM3CON<PWM3POL>
extern volatile __bit                   PWM3POL             __at(0x30CC);	// @ (0x619 * 8 + 4)
#define                                 PWM3POL_bit         _BIT_ACCESS(PWM3CON,4)
// PWM4DCH<PWM4DCH0>
extern volatile __bit                   PWM4DCH0            __at(0x30D8);	// @ (0x61B * 8 + 0)
#define                                 PWM4DCH0_bit        _BIT_ACCESS(PWM4DCH,0)
// PWM4DCH<PWM4DCH1>
extern volatile __bit                   PWM4DCH1            __at(0x30D9);	// @ (0x61B * 8 + 1)
#define                                 PWM4DCH1_bit        _BIT_ACCESS(PWM4DCH,1)
// PWM4DCH<PWM4DCH2>
extern volatile __bit                   PWM4DCH2            __at(0x30DA);	// @ (0x61B * 8 + 2)
#define                                 PWM4DCH2_bit        _BIT_ACCESS(PWM4DCH,2)
// PWM4DCH<PWM4DCH3>
extern volatile __bit                   PWM4DCH3            __at(0x30DB);	// @ (0x61B * 8 + 3)
#define                                 PWM4DCH3_bit        _BIT_ACCESS(PWM4DCH,3)
// PWM4DCH<PWM4DCH4>
extern volatile __bit                   PWM4DCH4            __at(0x30DC);	// @ (0x61B * 8 + 4)
#define                                 PWM4DCH4_bit        _BIT_ACCESS(PWM4DCH,4)
// PWM4DCH<PWM4DCH5>
extern volatile __bit                   PWM4DCH5            __at(0x30DD);	// @ (0x61B * 8 + 5)
#define                                 PWM4DCH5_bit        _BIT_ACCESS(PWM4DCH,5)
// PWM4DCH<PWM4DCH6>
extern volatile __bit                   PWM4DCH6            __at(0x30DE);	// @ (0x61B * 8 + 6)
#define                                 PWM4DCH6_bit        _BIT_ACCESS(PWM4DCH,6)
// PWM4DCH<PWM4DCH7>
extern volatile __bit                   PWM4DCH7            __at(0x30DF);	// @ (0x61B * 8 + 7)
#define                                 PWM4DCH7_bit        _BIT_ACCESS(PWM4DCH,7)
// PWM4DCL<PWM4DCL0>
extern volatile __bit                   PWM4DCL0            __at(0x30D6);	// @ (0x61A * 8 + 6)
#define                                 PWM4DCL0_bit        _BIT_ACCESS(PWM4DCL,6)
// PWM4DCL<PWM4DCL1>
extern volatile __bit                   PWM4DCL1            __at(0x30D7);	// @ (0x61A * 8 + 7)
#define                                 PWM4DCL1_bit        _BIT_ACCESS(PWM4DCL,7)
// PWM4CON<PWM4EN>
extern volatile __bit                   PWM4EN              __at(0x30E7);	// @ (0x61C * 8 + 7)
#define                                 PWM4EN_bit          _BIT_ACCESS(PWM4CON,7)
// PWM4CON<PWM4OUT>
extern volatile __bit                   PWM4OUT             __at(0x30E5);	// @ (0x61C * 8 + 5)
#define                                 PWM4OUT_bit         _BIT_ACCESS(PWM4CON,5)
// PWM4CON<PWM4POL>
extern volatile __bit                   PWM4POL             __at(0x30E4);	// @ (0x61C * 8 + 4)
#define                                 PWM4POL_bit         _BIT_ACCESS(PWM4CON,4)
// DAC2REF<R0>
extern volatile __bit                   R0                  __at(0x8D8);	// @ (0x11B * 8 + 0)
#define                                 R0_bit              _BIT_ACCESS(DAC2REF,0)
// DAC2REF<R1>
extern volatile __bit                   R1                  __at(0x8D9);	// @ (0x11B * 8 + 1)
#define                                 R1_bit              _BIT_ACCESS(DAC2REF,1)
// DAC2REF<R2>
extern volatile __bit                   R2                  __at(0x8DA);	// @ (0x11B * 8 + 2)
#define                                 R2_bit              _BIT_ACCESS(DAC2REF,2)
// DAC2REF<R3>
extern volatile __bit                   R3                  __at(0x8DB);	// @ (0x11B * 8 + 3)
#define                                 R3_bit              _BIT_ACCESS(DAC2REF,3)
// DAC2REF<R4>
extern volatile __bit                   R4                  __at(0x8DC);	// @ (0x11B * 8 + 4)
#define                                 R4_bit              _BIT_ACCESS(DAC2REF,4)
// PORTA<RA0>
extern volatile __bit                   RA0                 __at(0x60);	// @ (0xC * 8 + 0)
#define                                 RA0_bit             _BIT_ACCESS(PORTA,0)
// PORTA<RA1>
extern volatile __bit                   RA1                 __at(0x61);	// @ (0xC * 8 + 1)
